emacs.org
#+TITLE: Ryan Woodard's Emacs configuration
#+OPTIONS: toc:4 h:4
#+STARTUP: lognoterefile

* Remember 
- indirect buffers!
- http://angg.twu.net/emacs.html#eev
- ergoemacs http://ergoemacs.org/emacs/emacs_best_keyboard.html
- https://thepointsguy.com/2016/02/5-things-to-know-global-entry/
- https://github.com/nteract/sidecar
- https://ptgriffiths.wordpress.com/2017/02/05/jupyter-notebook-emacsipython-and-vimipython-integration/
- https://snarfed.org/dotfiles/.emacs
- https://github.com/zbskii/misc/blob/master/.emacs.d/init.el (Brett)
- http://www.howardism.org/
- https://github.com/winterTTr/ace-jump-mode
- http://doc.rix.si/cce/cce.html
- http://www.splode.com/~friedman/software/emacs-lisp/


* Notes, non elisp

We dearly thank [[http://sachachua.com][Sacha Chua]] for many ideas from [[http://sachachua.com/dotemacs][this file]], vision and
general great stuff.  She is wonderful.

* No external package dependencies
** General setup, preferences

#+BEGIN_SRC emacs-lisp :tangle yes
  (menu-bar-mode 1)                                   ;; -1 turns off
  (scroll-bar-mode -1)
  (column-number-mode 1)
  (fset 'yes-or-no-p 'y-or-n-p)
  (setq org-src-fontify-natively t)                   ;; fontify code blocks, I hope
  (add-hook 'text-mode-hook 'turn-on-auto-fill)       ;; auto-fill always on
  (setq custom-file "~/.emacs.d/custom-settings.el")
#+END_SRC

** Machine, OS

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; check OS type
  (setq is-linux nil)
  (setq is-mac nil)
  (cond
   ((string-equal system-type "darwin") ; Mac OS X
    (progn
      (message "Mac OS X")
      (setq is-mac t)))
   ((string-equal system-type "gnu/linux") ; linux
    (progn
      (message "Linux")
      (setq is-linux t))))
#+END_SRC

** Emacs version

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; check emacs version
  (if (version< emacs-version "25.1")
      ((message "Old Emacs, YMMV")
       (kill-emacs))
    (message "Why not try 26.1?"))
#+END_SRC

** Friendly greeting

#+BEGIN_SRC emacs-lisp :tangle yes
  (message "Spinning up %s@%s using %s"
	   system-name
	   user-login-name
	   ;;user-emacs-directory
	   user-init-file)
#+END_SRC

** Frame size, font (no colors yet).

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;  t for a termcap frame (a character-only terminal),
  ;; ‘x’ for an Emacs frame that is really an X window,
  ;; ‘w32’ for an Emacs frame that is a window on MS-Windows display,
  ;; ‘ns’ for an Emacs frame on a GNUstep or Macintosh Cocoa display,

  ;; Readability counts.
  ;; `C-x C-+’ and ‘C-x C--’
  ;; C-x C-0 to reset.
  (when (eq is-linux t)
    ;; Readable font
    (when (eq window-system 'x)
      (set-face-attribute 'default nil :height 260)
      (add-to-list 'initial-frame-alist '(height . 55))
      (add-to-list 'initial-frame-alist '(width . 80))
      (add-to-list 'default-frame-alist '(height . 55))
      (add-to-list 'default-frame-alist '(width . 80))))

  (when (eq is-mac t)

    ;; Macbook built-in display.
    (when (eq window-system 'ns)
      ;; On Mac, use Command-t to bring up font menu.
      (set-face-attribute 'default nil :height 220)
      ;;(set-face-attribute 'default nil :height 240)
      (add-to-list 'initial-frame-alist '(height . 33))
      (add-to-list 'initial-frame-alist '(width . 80))
      (add-to-list 'default-frame-alist '(height . 33))
      (add-to-list 'default-frame-alist '(width . 80))))
#+END_SRC

