emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-10 Wed 21:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ryan Woodard's Emacs configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ryan Woodard" />
</head>
<body>
<div id="content">
<h1 class="title">Ryan Woodard's Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org22b3049">1. Remember</a></li>
<li><a href="#org28e0f86">2. Notes, non elisp</a></li>
<li><a href="#orgada172f">3. No external package dependencies</a>
<ul>
<li><a href="#org50487fc">3.1. General setup, preferences</a></li>
<li><a href="#org99ed6c7">3.2. Machine, OS</a></li>
<li><a href="#org4aa43a7">3.3. Emacs version</a></li>
<li><a href="#org43e615f">3.4. Friendly greeting</a></li>
<li><a href="#orgc373395">3.5. Frame size, font (no colors yet).</a></li>
<li><a href="#org7b1f040">3.6. Who am I?</a></li>
</ul>
</li>
<li><a href="#org23cad62">4. package, use-package</a></li>
<li><a href="#org47def83">5. org</a>
<ul>
<li><a href="#org433181c">5.1. Install Emacs, org-mode source and needed packages on debian-based</a></li>
<li><a href="#orga61e7da">5.2. Version check</a></li>
<li><a href="#org8793fc6">5.3. use-package org, config babel load lang, ob-ipython, org element</a></li>
<li><a href="#org915446f">5.4. org mode structure templates (<code>&lt;s</code> things)</a></li>
<li><a href="#org772dd3a">5.5. speed commands, src blocks</a></li>
<li><a href="#org5eeae2e">5.6. skinning, looking good</a></li>
</ul>
</li>
<li><a href="#org345a087">6. External packages</a>
<ul>
<li><a href="#org222e080">6.1. Magit - nice git interface</a></li>
<li><a href="#orgcb19045">6.2. Mode line format</a></li>
<li><a href="#org632f1c9">6.3. parens and such</a></li>
<li><a href="#org0937aa9">6.4. srspeedbar (speedbar in same frame)</a></li>
<li><a href="#org7102769">6.5. writeroom mode (for concentrating)</a></li>
<li><a href="#orgfc996b4">6.6. yas snippets (from Sacha)</a></li>
</ul>
</li>
<li><a href="#orgf581247">7. helm</a></li>
<li><a href="#orgc71d81b">8. Python</a>
<ul>
<li><a href="#org3feba14">8.1. Make jupyter default shell</a></li>
<li><a href="#org8037d11">8.2. scimax, its version of ob-ipython</a></li>
<li><a href="#org38cc182">8.3. elpy</a></li>
</ul>
</li>
<li><a href="#orgb77d135">9. Colors</a>
<ul>
<li><a href="#orga003863">9.1. material</a></li>
<li><a href="#org38c3f09">9.2. Sacha solarized</a></li>
<li><a href="#org998d2df">9.3. org block faces</a></li>
<li><a href="#org3faa183">9.4. kaolin</a></li>
</ul>
</li>
<li><a href="#org4c080f9">10. Utility functions</a>
<ul>
<li><a href="#org44a6802">10.1. unfill paragraph</a></li>
</ul>
</li>
<li><a href="#org33f1ebe">11. Dashboard at startup</a></li>
<li><a href="#orgf3bbbde">12. Initial files to load</a></li>
<li><a href="#org970ff08">13. shell, term, etc.</a></li>
<li><a href="#org3ee203a">14. My function key bindings</a>
<ul>
<li><a href="#org97eff84">14.1. Summary table</a>
<ul>
<li><a href="#org64ce37e">14.1.1. old</a></li>
<li><a href="#orga77d46b">14.1.2. current</a></li>
</ul>
</li>
<li><a href="#org1f8684c">14.2. code</a></li>
<li><a href="#org2054508">14.3. help</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org22b3049" class="outline-2">
<h2 id="org22b3049"><span class="section-number-2">1</span> Remember</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>indirect buffers!</li>
<li><a href="http://angg.twu.net/emacs.html#eev">http://angg.twu.net/emacs.html#eev</a></li>
<li>ergoemacs <a href="http://ergoemacs.org/emacs/emacs_best_keyboard.html">http://ergoemacs.org/emacs/emacs_best_keyboard.html</a></li>
<li><a href="https://thepointsguy.com/2016/02/5-things-to-know-global-entry/">https://thepointsguy.com/2016/02/5-things-to-know-global-entry/</a></li>
<li><a href="https://github.com/nteract/sidecar">https://github.com/nteract/sidecar</a></li>
<li><a href="https://ptgriffiths.wordpress.com/2017/02/05/jupyter-notebook-emacsipython-and-vimipython-integration/">https://ptgriffiths.wordpress.com/2017/02/05/jupyter-notebook-emacsipython-and-vimipython-integration/</a></li>
<li><a href="https://snarfed.org/dotfiles/.emacs">https://snarfed.org/dotfiles/.emacs</a></li>
<li><a href="https://github.com/zbskii/misc/blob/master/.emacs.d/init.el">https://github.com/zbskii/misc/blob/master/.emacs.d/init.el</a> (Brett)</li>
<li><a href="http://www.howardism.org/">http://www.howardism.org/</a></li>
<li><a href="https://github.com/winterTTr/ace-jump-mode">https://github.com/winterTTr/ace-jump-mode</a></li>
<li><a href="http://doc.rix.si/cce/cce.html">http://doc.rix.si/cce/cce.html</a></li>
<li><a href="http://www.splode.com/~friedman/software/emacs-lisp/">http://www.splode.com/~friedman/software/emacs-lisp/</a></li>
</ul>
</div>
</div>


<div id="outline-container-org28e0f86" class="outline-2">
<h2 id="org28e0f86"><span class="section-number-2">2</span> Notes, non elisp</h2>
<div class="outline-text-2" id="text-2">
<p>
We dearly thank <a href="http://sachachua.com">Sacha Chua</a> for many ideas from <a href="http://sachachua.com/dotemacs">this file</a>, vision and
general great stuff.  She is wonderful.
</p>
</div>
</div>

<div id="outline-container-orgada172f" class="outline-2">
<h2 id="orgada172f"><span class="section-number-2">3</span> No external package dependencies</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org50487fc" class="outline-3">
<h3 id="org50487fc"><span class="section-number-3">3.1</span> General setup, preferences</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(menu-bar-mode 1)                                   <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">-1 turns off</span>
(scroll-bar-mode -1)
(column-number-mode 1)
(fset 'yes-or-no-p 'y-or-n-p)
(<span style="color: #fff59d;">setq</span> org-src-fontify-natively t)                   <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">fontify code blocks, I hope</span>
(add-hook 'text-mode-hook 'turn-on-auto-fill)       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">auto-fill always on</span>
(<span style="color: #fff59d;">setq</span> custom-file <span style="color: #9ccc65;">"~/.emacs.d/custom-settings.el"</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org99ed6c7" class="outline-3">
<h3 id="org99ed6c7"><span class="section-number-3">3.2</span> Machine, OS</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">check OS type</span>
(<span style="color: #fff59d;">setq</span> is-linux nil)
(<span style="color: #fff59d;">setq</span> is-mac nil)
(<span style="color: #fff59d;">cond</span>
 ((string-equal system-type <span style="color: #9ccc65;">"darwin"</span>) <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">Mac OS X</span>
  (<span style="color: #fff59d;">progn</span>
    (message <span style="color: #9ccc65;">"Mac OS X"</span>)
    (<span style="color: #fff59d;">setq</span> is-mac t)))
 ((string-equal system-type <span style="color: #9ccc65;">"gnu/linux"</span>) <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">linux</span>
  (<span style="color: #fff59d;">progn</span>
    (message <span style="color: #9ccc65;">"Linux"</span>)
    (<span style="color: #fff59d;">setq</span> is-linux t))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org4aa43a7" class="outline-3">
<h3 id="org4aa43a7"><span class="section-number-3">3.3</span> Emacs version</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">check emacs version</span>
(<span style="color: #fff59d;">if</span> (version&lt; emacs-version <span style="color: #9ccc65;">"25.1"</span>)
    ((message <span style="color: #9ccc65;">"Old Emacs, YMMV"</span>)
     (kill-emacs))
  (message <span style="color: #9ccc65;">"Why not try 26.1?"</span>))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org43e615f" class="outline-3">
<h3 id="org43e615f"><span class="section-number-3">3.4</span> Friendly greeting</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"Spinning up %s@%s using %s"</span>
         system-name
         user-login-name
         <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">user-emacs-directory</span>
         user-init-file)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgc373395" class="outline-3">
<h3 id="orgc373395"><span class="section-number-3">3.5</span> Frame size, font (no colors yet).</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;;  </span><span style="color: #b0bec5;">t for a termcap frame (a character-only terminal),</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&#8216;x&#8217; for an Emacs frame that is really an X window,</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&#8216;</span><span style="color: #b0bec5;">w32</span><span style="color: #b0bec5;">&#8217; for an Emacs frame that is a window on MS-Windows display,</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&#8216;</span><span style="color: #b0bec5;">ns</span><span style="color: #b0bec5;">&#8217; for an Emacs frame on a GNUstep or Macintosh Cocoa display,</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Readability counts.</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">`C-x C-+&#8217; and &#8216;C-x C--&#8217;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">C-x C-0 to reset.</span>
(<span style="color: #fff59d;">when</span> (eq is-linux t)
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Readable font</span>
  (<span style="color: #fff59d;">when</span> (eq window-system 'x)
    (set-face-attribute 'default nil <span style="color: #ff8A65;">:height</span> 260)
    (add-to-list 'initial-frame-alist '(height . 55))
    (add-to-list 'initial-frame-alist '(width . 80))
    (add-to-list 'default-frame-alist '(height . 55))
    (add-to-list 'default-frame-alist '(width . 80))))

(<span style="color: #fff59d;">when</span> (eq is-mac t)

  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Macbook built-in display.</span>
  (<span style="color: #fff59d;">when</span> (eq window-system 'ns)
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">On Mac, use Command-t to bring up font menu.</span>
    (set-face-attribute 'default nil <span style="color: #ff8A65;">:height</span> 220)
    <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">(set-face-attribute 'default nil :height 240)</span>
    (add-to-list 'initial-frame-alist '(height . 33))
    (add-to-list 'initial-frame-alist '(width . 80))
    (add-to-list 'default-frame-alist '(height . 33))
    (add-to-list 'default-frame-alist '(width . 80))))
</code></pre>
</div>
</div>
</div>
