emacs.org
** Who am I?

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq user-full-name "Ryan Woodard")
  (when (eq user-login-name "ryan")
    (setq user-mail-address "ryan@timehaven.org"))
  (when (eq user-login-name 'rwoodard)
    (setq user-mail-address "rwoodard@appnexus.com"))
#+END_SRC

* package, use-package

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'package)
  (setq package-enable-at-startup nil)   ; To prevent initialising twice

  ;; Default  ("gnu" . "http://elpa.gnu.org/packages/")
  ;; add-to-list always adds element to beginning of list
  ;;  (unless t is after element to add).
  (add-to-list 'package-archives '("melpa stable" . "https://stable.melpa.org/packages/"))
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  (add-to-list 'package-archives '("elpy" . "https://jorgenschaefer.github.io/packages/"))

  (add-to-list 'package-archive-priorities '("elpy"         . 4))
  (add-to-list 'package-archive-priorities '("melpa"        . 3))
  (add-to-list 'package-archive-priorities '("melpa stable" . 2))
  (add-to-list 'package-archive-priorities '("gnu"          . 1))

  (message "***** package-initialize *****")
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (message "***** package-refresh-contents *****")
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (message "***** require use-package *****")
    (require 'use-package))

  ;; https://github.com/jwiegley/use-package
  (setq use-package-verbose t)
#+END_SRC

#+RESULTS:
: t

* org
