emacs.html

<div id="outline-container-org7b1f040" class="outline-3">
<h3 id="org7b1f040"><span class="section-number-3">3.6</span> Who am I?</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> user-full-name <span style="color: #9ccc65;">"Ryan Woodard"</span>)
(<span style="color: #fff59d;">when</span> (eq user-login-name <span style="color: #9ccc65;">"ryan"</span>)
  (<span style="color: #fff59d;">setq</span> user-mail-address <span style="color: #9ccc65;">"ryan@timehaven.org"</span>))
(<span style="color: #fff59d;">when</span> (eq user-login-name 'rwoodard)
  (<span style="color: #fff59d;">setq</span> user-mail-address <span style="color: #9ccc65;">"rwoodard@appnexus.com"</span>))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org23cad62" class="outline-2">
<h2 id="org23cad62"><span class="section-number-2">4</span> package, use-package</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">package</span>)
(<span style="color: #fff59d;">setq</span> package-enable-at-startup nil)   <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">To prevent initialising twice</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Default  ("gnu" . "http://elpa.gnu.org/packages/")</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">add-to-list always adds element to beginning of list</span>
<span style="color: #b0bec5;">;;  </span><span style="color: #b0bec5;">(unless t is after element to add).</span>
(add-to-list 'package-archives '(<span style="color: #9ccc65;">"melpa stable"</span> . <span style="color: #9ccc65;">"https://stable.melpa.org/packages/"</span>))
(add-to-list 'package-archives '(<span style="color: #9ccc65;">"melpa"</span> . <span style="color: #9ccc65;">"http://melpa.org/packages/"</span>))
(add-to-list 'package-archives '(<span style="color: #9ccc65;">"elpy"</span> . <span style="color: #9ccc65;">"https://jorgenschaefer.github.io/packages/"</span>))

(add-to-list 'package-archive-priorities '(<span style="color: #9ccc65;">"elpy"</span>         . 4))
(add-to-list 'package-archive-priorities '(<span style="color: #9ccc65;">"melpa"</span>        . 3))
(add-to-list 'package-archive-priorities '(<span style="color: #9ccc65;">"melpa stable"</span> . 2))
(add-to-list 'package-archive-priorities '(<span style="color: #9ccc65;">"gnu"</span>          . 1))

(message <span style="color: #9ccc65;">"***** package-initialize *****"</span>)
(package-initialize)

(<span style="color: #fff59d;">unless</span> (package-installed-p 'use-package)
  (message <span style="color: #9ccc65;">"***** package-refresh-contents *****"</span>)
  (package-refresh-contents)
  (package-install 'use-package))

(<span style="color: #fff59d;">eval-when-compile</span>
  (message <span style="color: #9ccc65;">"***** require use-package *****"</span>)
  (<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">use-package</span>))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">https://github.com/jwiegley/use-package</span>
(<span style="color: #fff59d;">setq</span> use-package-verbose t)
</code></pre>
</div>
</div>
</div>
