emacs.org
** Install Emacs, org-mode source and needed packages on debian-based
#+BEGIN_SRC sh
  sudo apt-get install emacs25-common-non-dfsg install-info \
       texi2html texinfo texinfo-doc-nonfree
  mkdir $HOME/.emacs.d/elisp && cd $HOME/.emacs.d/elisp
  git clone git://orgmode.org/org-mode.git
  cd org-mode && make
#+END_SRC

To update occasionally:

#+BEGIN_SRC sh nil
  ls
#+END_SRC

#+RESULTS:
: /Users/rwoodard/.emacs.d

#+BEGIN_SRC sh
  cd $HOME/elisp/org-mode && make up2
  git log  # to see what has changed
  git gc  # to clean things up, keep dir smaller
#+END_SRC

#+RESULTS:
| commit  | 342f48f1584393e058c74a1b6b66996e45b7dd16 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | May                                  | 7                          |                       06:19:04 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | org                                      | src                                  | block                      |                        motion, | creation |     funcs | bound   | to      | f     | keys |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 18de91ffa8156b9ed92369fc4a63bf63884e7281 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Thu                                      | May                                  | 4                          |                       17:24:08 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | new                                      | shell,                               | terminal                   |                         helper |    stuff |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 46e7bc485384af665a285782bcf0658effbbc460 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | May                                  | 3                          |                       17:54:47 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | elpy                                     | and                                  | shell                      |                          speed | commands |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | d39e4052992387511cdf3d4cce80700277cee951 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Tue                                      | May                                  | 2                          |                       19:35:40 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | new                                      | files                                | at                         |                          start |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 9516790242de5495c13cb26fb4c760b078ba9e9a |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Tue                                      | May                                  | 2                          |                       19:26:34 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| More    | session                                  | and                                  | blah                       |                           work |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | d30fd36ccfa12d65e78bed24bc459dacdf162259 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | May                                  | 1                          |                       22:04:06 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Change  | colors                                   |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 2fe2800b2cc668285f3f4ed2b6f2dcabc33a9ca0 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | May                                  | 1                          |                       17:05:15 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| More    | speed                                    | command                              | src                        |                          block |   stuff, |       not | working |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | b7bfbfd45d180e88bb5ce099cbe7701ef798cec9 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | May                                  | 1                          |                       09:24:18 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | speed                                    | key                                  | for                        |                            src |  blocks, |     widen |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | f17280d12e4b71715f6c28c2aa19c7ed11764a24 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       22:27:05 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Remove  | menu                                     | and                                  | scroll                     |                           bars |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 9b1e35a0f775e3f21b78c3a9301e5d49c552b6e9 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Merge:  | 42bac8a                                  | a16d52b                              |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       22:19:49 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Merge   | branch                                   | 'master'                             | of                         | github.com:timehaven/dotemacsd |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 42bac8a9fddc6345b110cf53a8f32ad3d843d685 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       22:18:50 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Merge   | with                                     | home                                 |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | a16d52bbfaf1236569945edafc8618bdbac72b58 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       22:17:01 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | dashboard                                |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | a6773ab33a136f927ba4269b4eb4a25b4e8ba5d0 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       01:05:16 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Remove  | all                                      | elpa                                 | dependency                 |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 87ec75c72210fe5858e854f09ebe696f70c3d0a5 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       00:50:41 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Ignore  | more                                     | things                               |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | e835672daee20185a02cd567079767c11399334d |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       00:49:28 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Remove  | lots                                     | of                                   | elpa                       |                         things |     that |    should | not     | be      | saved |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 5d401f37a64d7217ae3aa2494d0afbe6d726c47d |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sun                                      | Apr                                  | 30                         |                       00:44:27 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Change  | to                                       | real                                 | init.el                    |                           that |    calls | emacs.org |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | dca75c1b8cbeb144381dae3039a2ca812f8ba990 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Fri                                      | Apr                                  | 28                         |                       16:27:08 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Make    | it                                       | better                               | each                       |                            day |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 9d045b8127882b33ca2852bb24b45a7f98e629af |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Fri                                      | Apr                                  | 28                         |                       09:15:30 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Improve | use-package                              | and                                  | auto                       |                           load |       of |     files | at      | startup |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 4860d94fbd83a609101682c7a962e69c3996f93c |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Thu                                      | Apr                                  | 27                         |                       17:18:42 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Tweak   |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | f8907ed1ab8542a03e86602ab40f1b543bf77836 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | Apr                                  | 26                         |                       23:08:48 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Fix     | helm-org                                 | interaction                          |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 63a5efef12874610781edc7e14616d3fbf7838ae |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | Apr                                  | 26                         |                       22:44:13 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Remove  | helm,                                    | it                                   | conflicts                  |                           with |   latest |       org | (for    | now)    |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 9392c221123e261ce32a3f9324b3368ec13726cd |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | Apr                                  | 26                         |                       17:56:28 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | helm                                     |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | ed05c134805e039b69b704e7ed0a75939ce5b2c0 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | Apr                                  | 26                         |                       07:49:59 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | *.pyc                                    | to                                   | .gitignore                 |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | cae6d4af8db9f318302b690a50afec616285a682 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Tue                                      | Apr                                  | 25                         |                       17:09:28 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Back    | to                                       | trying                               | out                        |                          jedi, |  improve |    python | src     | block   |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 3e2ac9e4e5d7d2da5e1b6dbac643cb617f071dcc |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Tue                                      | Apr                                  | 25                         |                       10:41:48 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | some                                     | file                                 | jumping,                   |                            org |   refile |     stuff |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 402bba2d36dbba3d270f2d4c151d6445effac7bb |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Tue                                      | Apr                                  | 25                         |                       08:47:05 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Remove  | jedi,                                    | add                                  | elpy,                      |                            try |       to |       get | org     | babel   | eval  | to   | work | (not | yet) |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 0bf2109a8f97d5cc768f87509f4b46b8587133c2 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       19:11:08 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | x                                        | frame                                | attributes                 |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | eaca996006d0b57713d9f325031d8b52a6dad23f |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       18:55:36 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Fix     | org                                      | info                                 | load                       |                         order, |      add |   initial | Python  |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | f2d2ec2592a8c7dc2bcc29304a0774ce48d13793 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       15:13:14 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Tweak   |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | b686e8351680e5a9160c3a6bb5776a2db99ed97b |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       15:00:15 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | tangle                                   | file                                 |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 77de9ed2a580b7ef0b0610936c02796df05dbf6f |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       13:44:15 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | some                                     | keys                                 | and                        |                         colors |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 4ccaf5b74dbbe5600e051d3c71643e4b67666d99 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <ryan@timehaven.org>       |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       13:31:35 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Install | on                                       | new                                  | machine                    |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 3a30bad5f58b66b78f4087c61f9dcdc9407e47e1 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | The                                      | Guest                                | <guest@john.timehaven.net> |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       13:07:54 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | magit                                    | options                              |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | f795e5b9b17617ec26d009fcdc1b786d26b565e3 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | The                                      | Guest                                | <guest@john.timehaven.net> |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       11:56:14 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Add     | new                                      | info                                 | path,                      |                          magit |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 7b8651ce7a4ab50f6cf07c58aad13aa9c873a41d |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | The                                      | Guest                                | <guest@john.timehaven.net> |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Mon                                      | Apr                                  | 24                         |                       10:03:23 |     2017 |      -700 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Use     | Sacha                                    | config                               | paradigm                   |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 8aede5f01a1a81eb6682fa4c2588b25c371581be |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Fri                                      | May                                  | 2                          |                       16:28:05 |     2014 |     +0000 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Tweak   | f5.                                      |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | cefa357cac928f943495bba5bdd7cd36ac332b95 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <rwoodard@appnexus.com>    |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Wed                                      | Apr                                  | 30                         |                       18:03:26 |     2014 |     +0000 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Cleaner | packaging.                               |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | fb9fe1039032c02f85e18ce78286e0bcfb629662 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | Ryan                                     | Woodard                              | <github@timehaven.org>     |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Sat                                      | Jan                                  | 11                         |                       02:30:30 |     2014 |     +0000 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Begin.  |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| commit  | 6890c28eb32693d716438466038e727c8f854d37 |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Author: | timehaven                                | <timehaven@users.noreply.github.com> |                            |                                |          |           |         |         |       |      |      |      |      |
| Date:   | Fri                                      | Jan                                  | 10                         |                       09:59:31 |     2014 |      -800 |         |         |       |      |      |      |      |
|         |                                          |                                      |                            |                                |          |           |         |         |       |      |      |      |      |
| Initial | commit                                   |                                      |                            |                                |          |           |         |         |       |      |      |      |      |

