emacs.html

<div id="outline-container-org47def83" class="outline-2">
<h2 id="org47def83"><span class="section-number-2">5</span> org</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org433181c" class="outline-3">
<h3 id="org433181c"><span class="section-number-3">5.1</span> Install Emacs, org-mode source and needed packages on debian-based</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre><code class="src src-sh">sudo apt-get install emacs25-common-non-dfsg install-info <span style="color: #9ccc65;">\</span>
     texi2html texinfo texinfo-doc-nonfree
mkdir $<span style="color: #ffcc80;">HOME</span>/.emacs.d/elisp &amp;&amp; <span style="color: #ff8A65;">cd</span> $<span style="color: #ffcc80;">HOME</span>/.emacs.d/elisp
git clone git://orgmode.org/org-mode.git
<span style="color: #ff8A65;">cd</span> org-mode &amp;&amp; make
</code></pre>
</div>

<p>
To update occasionally:
</p>

<div class="org-src-container">
<pre><code class="src src-sh">ls
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-sh"><span style="color: #ff8A65;">cd</span> $<span style="color: #ffcc80;">HOME</span>/elisp/org-mode &amp;&amp; make up2
git log  <span style="color: #b0bec5;"># </span><span style="color: #b0bec5;">to see what has changed</span>
git gc  <span style="color: #b0bec5;"># </span><span style="color: #b0bec5;">to clean things up, keep dir smaller</span>
</code></pre>
</div>
</div>
</div>
