emacs.org
** Version check

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my/check-org ()
  (message (concat "org-version " org-version))
  (if (version< org-version "9.0")
      (progn
	(message "Yuck!  Old org!")
	(kill-emacs))
    (message "Why not try 9.1 now?")))
(my/check-org)
#+END_SRC

** use-package org, config babel load lang, ob-ipython, org element
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq jupyter-console-exec (substitute-in-file-name
			      "$HOME/local/miniconda3/envs/py36/bin/jupyter"))
  (message "***** use-package ob-ipython *****")
  (use-package ob-ipython
    :ensure t
    :config
    (setq ob-ipython-command jupyter-console-exec)
    (setq ob-ipython-kernel-extra-args '("--simple-prompt")))
#+END_SRC

#+BEGIN_SRC ipython :session
print("Hello, world!")
a = 5
#+END_SRC

#+RESULTS:
:RESULTS:
Hello, world!
:END:

#+BEGIN_SRC ipython :session
  %matplotlib inline
  import matplotlib.pyplot as plt
  import numpy as np
#+END_SRC

#+BEGIN_SRC ipython :session
  %matplotlib osx
  import matplotlib.pyplot as plt
  import numpy as np
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

#+BEGIN_SRC ipython :session :results output drawer
plt.plot([1, 2, 3])  
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package org *****")
  (use-package org
    :load-path "~/.emacs.d/elisp/org-mode/lisp"  ;; redundant, at this point
    :ensure ob-ipython
    :config
    (progn

      ;; Some of this stuff is for ob-ipython, scimax, etc.
      (setq org-startup-with-inline-images t)
      (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)

      (org-babel-do-load-languages
       'org-babel-load-languages
       '(
	 ;; (dot . t)
	 ;;   (ditaa . t)
	 (emacs-lisp . t)
	 (python . t)
	 (ipython . t)
	 (sh . t)
	 ;; (sqlite . t)
	 ;; (http . t)
	 ;; (ledger . t)
	 (shell . t)
	 ;; (R . t)))
	 ))
      ))

  (defun my-org-confirm-babel-evaluate (lang body)
    (and
    (not (string= lang "ipython"))
    (not (string= lang "sh"))
    (not (string= lang "emacs-lisp"))
    ))  ; don't ask for these languages
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

  (message "***** use-package org-element *****")
  (use-package org-element
    :load-path "~/.emacs.d/elisp/org-mode/lisp")
#+END_SRC

#+RESULTS:

Sacha doesn't want to get distracted by the same code in the other
window, so I want org src to use the current window.

#+begin_src emacs-lisp :tangle yes
  (setq org-src-window-setup 'current-window)
#+end_src

** org mode structure templates (=<s= things)
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-structure-template-alist
       '(("s" "#+BEGIN_SRC ?\n\n#+END_SRC" "<src lang=\"?\">\n\n</src>")
          ("e" "#+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE" "<example>\n?\n</example>")
          ("q" "#+BEGIN_QUOTE\n?\n#+END_QUOTE" "<quote>\n?\n</quote>")
          ("v" "#+BEGIN_VERSE\n?\n#+END_VERSE" "<verse>\n?\n</verse>")
          ("c" "#+BEGIN_COMMENT\n?\n#+END_COMMENT")
	 ("p" "#+BEGIN_SRC ipython :session :async t\n?\n#+END_SRC" "<src lang=\"ipython\">\n?\n</src>")
          ;;("p" "#+BEGIN_PRACTICE\n?\n#+END_PRACTICE")
          ("l" "#+BEGIN_SRC emacs-lisp :tangle yes\n?\n#+END_SRC" "<src lang=\"emacs-lisp\">\n?\n</src>")
          ("L" "#+latex: " "<literal style=\"latex\">?</literal>")
          ("h" "#+BEGIN_HTML\n?\n#+END_HTML" "<literal style=\"html\">\n?\n</literal>")
          ("H" "#+html: " "<literal style=\"html\">?</literal>")
          ("a" "#+BEGIN_ASCII\n?\n#+END_ASCII")
          ("A" "#+ascii: ")
          ("i" "#+index: ?" "#+index: ?")
          ("I" "#+include %file ?" "<include file=%file markup=\"?\">")))
#+END_SRC

#+RESULTS:
| s | #+BEGIN_SRC ? |

