emacs.html

<div id="outline-container-orga61e7da" class="outline-3">
<h3 id="orga61e7da"><span class="section-number-3">5.2</span> Version check</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/check-org</span> ()
  (message (concat <span style="color: #9ccc65;">"org-version "</span> org-version))
  (<span style="color: #fff59d;">if</span> (version&lt; org-version <span style="color: #9ccc65;">"9.0"</span>)
      (<span style="color: #fff59d;">progn</span>
        (message <span style="color: #9ccc65;">"Yuck!  Old org!"</span>)
        (kill-emacs))
    (message <span style="color: #9ccc65;">"Why not try 9.1 now?"</span>)))
(my/check-org)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org8793fc6" class="outline-3">
<h3 id="org8793fc6"><span class="section-number-3">5.3</span> use-package org, config babel load lang, ob-ipython, org element</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> jupyter-console-exec (substitute-in-file-name
                            <span style="color: #9ccc65;">"$HOME/local/miniconda3/envs/py36/bin/jupyter"</span>))
(message <span style="color: #9ccc65;">"***** use-package ob-ipython *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">ob-ipython</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:config</span>
  (<span style="color: #fff59d;">setq</span> ob-ipython-command jupyter-console-exec)
  (<span style="color: #fff59d;">setq</span> ob-ipython-kernel-extra-args '(<span style="color: #9ccc65;">"--simple-prompt"</span>)))
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-ipython"><span style="color: #fff59d;">print</span>(<span style="color: #9ccc65;">"Hello, world!"</span>)
<span style="color: #ffcc80;">a</span> = 5
</code></pre>
</div>

<p>
Hello, world!
</p>

<div class="org-src-container">
<pre><code class="src src-ipython">%matplotlib inline
<span style="color: #fff59d;">import</span> matplotlib.pyplot <span style="color: #fff59d;">as</span> plt
<span style="color: #fff59d;">import</span> numpy <span style="color: #fff59d;">as</span> np
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-ipython">%matplotlib osx
<span style="color: #fff59d;">import</span> matplotlib.pyplot <span style="color: #fff59d;">as</span> plt
<span style="color: #fff59d;">import</span> numpy <span style="color: #fff59d;">as</span> np
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-ipython">plt.plot([1, 2, 3])  
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package org *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">org</span>
  <span style="color: #ff8A65;">:load-path</span> <span style="color: #9ccc65;">"~/.emacs.d/elisp/org-mode/lisp"</span>  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">redundant, at this point</span>
  <span style="color: #ff8A65;">:ensure</span> ob-ipython
  <span style="color: #ff8A65;">:config</span>
  (<span style="color: #fff59d;">progn</span>

    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Some of this stuff is for ob-ipython, scimax, etc.</span>
    (<span style="color: #fff59d;">setq</span> org-startup-with-inline-images t)
    (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)

    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(dot . t)</span>
       <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(ditaa . t)</span>
       (emacs-lisp . t)
       (python . t)
       (ipython . t)
       (sh . t)
       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(sqlite . t)</span>
       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(http . t)</span>
       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(ledger . t)</span>
       (shell . t)
       <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(R . t)))</span>
       ))
    ))

(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my-org-confirm-babel-evaluate</span> (lang body)
  (<span style="color: #fff59d;">and</span>
  (not (string= lang <span style="color: #9ccc65;">"ipython"</span>))
  (not (string= lang <span style="color: #9ccc65;">"sh"</span>))
  (not (string= lang <span style="color: #9ccc65;">"emacs-lisp"</span>))
  ))  <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">don't ask for these languages</span>
(<span style="color: #fff59d;">setq</span> org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

(message <span style="color: #9ccc65;">"***** use-package org-element *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">org-element</span>
  <span style="color: #ff8A65;">:load-path</span> <span style="color: #9ccc65;">"~/.emacs.d/elisp/org-mode/lisp"</span>)
</code></pre>
</div>

<p>
Sacha doesn't want to get distracted by the same code in the other
window, so I want org src to use the current window.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> org-src-window-setup 'current-window)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org915446f" class="outline-3">
<h3 id="org915446f"><span class="section-number-3">5.4</span> org mode structure templates (<code>&lt;s</code> things)</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> org-structure-template-alist
     '((<span style="color: #9ccc65;">"s"</span> <span style="color: #9ccc65;">"#+BEGIN_SRC ?\n\n#+END_SRC"</span> <span style="color: #9ccc65;">"&lt;src lang=\"?\"&gt;\n\n&lt;/src&gt;"</span>)
        (<span style="color: #9ccc65;">"e"</span> <span style="color: #9ccc65;">"#+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE"</span> <span style="color: #9ccc65;">"&lt;example&gt;\n?\n&lt;/example&gt;"</span>)
        (<span style="color: #9ccc65;">"q"</span> <span style="color: #9ccc65;">"#+BEGIN_QUOTE\n?\n#+END_QUOTE"</span> <span style="color: #9ccc65;">"&lt;quote&gt;\n?\n&lt;/quote&gt;"</span>)
        (<span style="color: #9ccc65;">"v"</span> <span style="color: #9ccc65;">"#+BEGIN_VERSE\n?\n#+END_VERSE"</span> <span style="color: #9ccc65;">"&lt;verse&gt;\n?\n&lt;/verse&gt;"</span>)
        (<span style="color: #9ccc65;">"c"</span> <span style="color: #9ccc65;">"#+BEGIN_COMMENT\n?\n#+END_COMMENT"</span>)
       (<span style="color: #9ccc65;">"p"</span> <span style="color: #9ccc65;">"#+BEGIN_SRC ipython :session :async t\n?\n#+END_SRC"</span> <span style="color: #9ccc65;">"&lt;src lang=\"ipython\"&gt;\n?\n&lt;/src&gt;"</span>)
        <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">("p" "#+BEGIN_PRACTICE\n?\n#+END_PRACTICE")</span>
        (<span style="color: #9ccc65;">"l"</span> <span style="color: #9ccc65;">"#+BEGIN_SRC emacs-lisp :tangle yes\n?\n#+END_SRC"</span> <span style="color: #9ccc65;">"&lt;src lang=\"emacs-lisp\"&gt;\n?\n&lt;/src&gt;"</span>)
        (<span style="color: #9ccc65;">"L"</span> <span style="color: #9ccc65;">"#+latex: "</span> <span style="color: #9ccc65;">"&lt;literal style=\"latex\"&gt;?&lt;/literal&gt;"</span>)
        (<span style="color: #9ccc65;">"h"</span> <span style="color: #9ccc65;">"#+BEGIN_HTML\n?\n#+END_HTML"</span> <span style="color: #9ccc65;">"&lt;literal style=\"html\"&gt;\n?\n&lt;/literal&gt;"</span>)
        (<span style="color: #9ccc65;">"H"</span> <span style="color: #9ccc65;">"#+html: "</span> <span style="color: #9ccc65;">"&lt;literal style=\"html\"&gt;?&lt;/literal&gt;"</span>)
        (<span style="color: #9ccc65;">"a"</span> <span style="color: #9ccc65;">"#+BEGIN_ASCII\n?\n#+END_ASCII"</span>)
        (<span style="color: #9ccc65;">"A"</span> <span style="color: #9ccc65;">"#+ascii: "</span>)
        (<span style="color: #9ccc65;">"i"</span> <span style="color: #9ccc65;">"#+index: ?"</span> <span style="color: #9ccc65;">"#+index: ?"</span>)
        (<span style="color: #9ccc65;">"I"</span> <span style="color: #9ccc65;">"#+include %file ?"</span> <span style="color: #9ccc65;">"&lt;include file=%file markup=\"?\"&gt;"</span>)))
</code></pre>
</div>
</div>
</div>
