emacs.org
** speed commands, src blocks
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (setq org-use-speed-commands t)  ;; Way cool!
  ;; For example, to activate speed commands when the point is on any
  ;; star at the beginning of the headline, you can do this:
  (setq org-use-speed-commands
	(lambda () (and (looking-at org-outline-regexp) (looking-back "^\**"))))

  (add-to-list 'org-speed-commands-user '("N" org-narrow-to-subtree))
  (add-to-list 'org-speed-commands-user '("W" widen))

  ;; Default speed commands already available:
  ;;  F   org-next-block
  ;;  B   org-previous-block
  ;; But do not work when at front of src block like
  ;;  #+BEGIN_SRC sh
  ;; etc.
  ;; So add 'F' and 'B' to speed keys when on src block.
  ;;
  ;; Basis of code from
  ;; http://kitchingroup.cheme.cmu.edu/blog/category/orgmode/2/
  (defun my/org-next-block-centered ()
    (interactive)
    (org-next-block)
    (recenter-top-bottom))

  (setq org-speed-commands-src-blocks
	'(
	  ;;("f" . my/org-next-block-centered)
	  ("F" . org-babel-next-src-block)
	  ("B" . org-babel-previous-src-block)))

  (defun org-speed-src-blocks (keys)
    ;; (and point-at-beginning-of-line is-a-src-block)
    (when (and (bolp) (looking-at org-babel-src-block-regexp))
      (cdr (assoc keys org-speed-commands-src-blocks))))

  (add-hook 'org-speed-command-hook 'org-speed-src-blocks)
#+end_src

#+RESULTS:
| org-speed-src-blocks | org-speed-command-activate | org-babel-speed-command-activate |

** skinning, looking good
http://www.howardism.org/Technical/Emacs/orgmode-wordprocessor.html
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-hide-emphasis-markers t)
  (font-lock-add-keywords 'org-mode
			  '(("^ +\\([-*]\\) "
			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (use-package org-bullets
    :ensure t
    :config
    (progn
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))))
#+END_SRC
* External packages
** Magit - nice git interface

#+begin_src emacs-lisp :tangle yes
  (message "***** use-package magit *****")
  (use-package magit
    :ensure t)
  (global-set-key (kbd "C-x g") 'magit-status)
  (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
  (setq global-magit-file-mode t)
#+end_src

** Mode line format

Display a more compact mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package smart-mode-line *****")
  (use-package smart-mode-line
    :ensure t)
#+END_SRC

#+RESULTS:
** parens and such
#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package smartparens *****")
  (use-package smartparens
    :ensure t
    :config
    (progn
      (require 'smartparens-config)
      (add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
      (add-hook 'emacs-lisp-mode-hook 'show-smartparens-mode)))
#+END_SRC
** srspeedbar (speedbar in same frame)
#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package sr-speedbar *****")
  (use-package sr-speedbar
    :ensure t)
    ;; :config
    ;; (progn
    ;;   (require 'smartparens-config)
    ;;   (add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
    ;;   (add-hook 'emacs-lisp-mode-hook 'show-smartparens-mode)))
#+END_SRC
** writeroom mode (for concentrating)
#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package writeroom-mode *****")
  (use-package writeroom-mode
    :ensure visual-fill-column
    :ensure t)
#+END_SRC
