emacs.html

<div id="outline-container-org772dd3a" class="outline-3">
<h3 id="org772dd3a"><span class="section-number-3">5.5</span> speed commands, src blocks</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq org-use-speed-commands t)  ;; Way cool!</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">For example, to activate speed commands when the point is on any</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">star at the beginning of the headline, you can do this:</span>
(<span style="color: #fff59d;">setq</span> org-use-speed-commands
      (<span style="color: #fff59d;">lambda</span> () (<span style="color: #fff59d;">and</span> (looking-at org-outline-regexp) (looking-back <span style="color: #9ccc65;">"^\**"</span>))))

(add-to-list 'org-speed-commands-user '(<span style="color: #9ccc65;">"N"</span> org-narrow-to-subtree))
(add-to-list 'org-speed-commands-user '(<span style="color: #9ccc65;">"W"</span> widen))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Default speed commands already available:</span>
<span style="color: #b0bec5;">;;  </span><span style="color: #b0bec5;">F   org-next-block</span>
<span style="color: #b0bec5;">;;  </span><span style="color: #b0bec5;">B   org-previous-block</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">But do not work when at front of src block like</span>
<span style="color: #b0bec5;">;;  </span><span style="color: #b0bec5;">#+BEGIN_SRC sh</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">etc.</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">So add 'F' and 'B' to speed keys when on src block.</span>
<span style="color: #b0bec5;">;;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Basis of code from</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">http://kitchingroup.cheme.cmu.edu/blog/category/orgmode/2/</span>
(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/org-next-block-centered</span> ()
  (<span style="color: #fff59d;">interactive</span>)
  (org-next-block)
  (recenter-top-bottom))

(<span style="color: #fff59d;">setq</span> org-speed-commands-src-blocks
      '(
        <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">("f" . my/org-next-block-centered)</span>
        (<span style="color: #9ccc65;">"F"</span> . org-babel-next-src-block)
        (<span style="color: #9ccc65;">"B"</span> . org-babel-previous-src-block)))

(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">org-speed-src-blocks</span> (keys)
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(and point-at-beginning-of-line is-a-src-block)</span>
  (<span style="color: #fff59d;">when</span> (<span style="color: #fff59d;">and</span> (bolp) (looking-at org-babel-src-block-regexp))
    (cdr (assoc keys org-speed-commands-src-blocks))))

(add-hook 'org-speed-command-hook 'org-speed-src-blocks)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org5eeae2e" class="outline-3">
<h3 id="org5eeae2e"><span class="section-number-3">5.6</span> skinning, looking good</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<a href="http://www.howardism.org/Technical/Emacs/orgmode-wordprocessor.html">http://www.howardism.org/Technical/Emacs/orgmode-wordprocessor.html</a>
</p>
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> org-hide-emphasis-markers t)
(font-lock-add-keywords 'org-mode
                        '((<span style="color: #9ccc65;">"^ +</span><span style="color: #9ccc65;">\\</span><span style="color: #9ccc65;">(</span><span style="color: #9ccc65;">[-*]</span><span style="color: #9ccc65;">\\</span><span style="color: #9ccc65;">)</span><span style="color: #9ccc65;"> "</span>
                           (0 (<span style="color: #fff59d;">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span style="color: #9ccc65;">"&#8226;"</span>))))))
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">org-bullets</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:config</span>
  (<span style="color: #fff59d;">progn</span>
    (add-hook 'org-mode-hook (<span style="color: #fff59d;">lambda</span> () (org-bullets-mode 1)))))
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org345a087" class="outline-2">
<h2 id="org345a087"><span class="section-number-2">6</span> External packages</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org222e080" class="outline-3">
<h3 id="org222e080"><span class="section-number-3">6.1</span> Magit - nice git interface</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package magit *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">magit</span>
  <span style="color: #ff8A65;">:ensure</span> t)
(global-set-key (kbd <span style="color: #9ccc65;">"C-x g"</span>) 'magit-status)
(global-set-key (kbd <span style="color: #9ccc65;">"C-x M-g"</span>) 'magit-dispatch-popup)
(<span style="color: #fff59d;">setq</span> global-magit-file-mode t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgcb19045" class="outline-3">
<h3 id="orgcb19045"><span class="section-number-3">6.2</span> Mode line format</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Display a more compact mode line
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package smart-mode-line *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">smart-mode-line</span>
  <span style="color: #ff8A65;">:ensure</span> t)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org632f1c9" class="outline-3">
<h3 id="org632f1c9"><span class="section-number-3">6.3</span> parens and such</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package smartparens *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">smartparens</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:config</span>
  (<span style="color: #fff59d;">progn</span>
    (<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">smartparens-config</span>)
    (add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
    (add-hook 'emacs-lisp-mode-hook 'show-smartparens-mode)))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org0937aa9" class="outline-3">
<h3 id="org0937aa9"><span class="section-number-3">6.4</span> srspeedbar (speedbar in same frame)</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package sr-speedbar *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">sr-speedbar</span>
  <span style="color: #ff8A65;">:ensure</span> t)
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">:config</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(progn</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(require 'smartparens-config)</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(add-hook 'emacs-lisp-mode-hook 'show-smartparens-mode)))</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7102769" class="outline-3">
<h3 id="org7102769"><span class="section-number-3">6.5</span> writeroom mode (for concentrating)</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package writeroom-mode *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">writeroom-mode</span>
  <span style="color: #ff8A65;">:ensure</span> visual-fill-column
  <span style="color: #ff8A65;">:ensure</span> t)
</code></pre>
</div>
</div>
</div>
