emacs.org
** yas snippets (from Sacha)
    #+begin_src emacs-lisp :tangle yes
      (use-package yasnippet
        :ensure t
        :diminish yas-minor-mode
        :init (yas-global-mode)
        :config
        (progn
          (yas-global-mode)
          ;; (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
          (setq yas-key-syntaxes '("w_" "w_." "^ "))
	  ;; Will be problem with yas upgrade...
          (setq yas-installed-snippets-dir "~/.emacs.d/elpa/yasnippet-20170418.351/snippets")
          (setq yas-expand-only-for-last-commands nil)
          (yas-global-mode 1)
          ;; (bind-key "\t" 'hippie-expand yas-minor-mode-map)
          (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)
      ;;        (global-set-key (kbd "C-c y") (lambda () (interactive)
      ;;                                         (yas/load-directory "~/elisp/snippets")))
      ))
#+end_src

#+RESULTS:
: t

From http://emacswiki.org/emacs/Yasnippet

#+begin_src emacs-lisp :tangle yes
  (defun shk-yas/helm-prompt (prompt choices &optional display-fn)
    "Use helm to select a snippet. Put this into `yas/prompt-functions.'"
    (interactive)
    (setq display-fn (or display-fn 'identity))
    (if (require 'helm-config)
        (let (tmpsource cands result rmap)
          (setq cands (mapcar (lambda (x) (funcall display-fn x)) choices))
          (setq rmap (mapcar (lambda (x) (cons (funcall display-fn x) x)) choices))
          (setq tmpsource
                (list
                 (cons 'name prompt)
                 (cons 'candidates cands)
                 '(action . (("Expand" . (lambda (selection) selection))))
                 ))
          (setq result (helm-other-buffer '(tmpsource) "*helm-select-yasnippet"))
          (if (null result)
              (signal 'quit "user quit!")
            (cdr (assoc result rmap))))
      nil))
#+end_src

From https://github.com/pcmantz/elisp/blob/master/my-bindings.el

#+begin_src emacs-lisp :tangle no
  (setq default-cursor-color "gray")
  (setq yasnippet-can-fire-cursor-color "purple")

  ;; It will test whether it can expand, if yes, cursor color -> green.
  (defun yasnippet-can-fire-p (&optional field)
    (interactive)
    (setq yas--condition-cache-timestamp (current-time))
    (let (templates-and-pos)
      (unless (and yas-expand-only-for-last-commands
                   (not (member last-command yas-expand-only-for-last-commands)))
	(setq templates-and-pos (if field
                                    (save-restriction
                                      (narrow-to-region (yas--field-start field)
							(yas--field-end field))
                                      (yas--templates-for-key-at-point))
                                  (yas--templates-for-key-at-point))))
      (and templates-and-pos (first templates-and-pos))))

  (defun my/change-cursor-color-when-can-expand (&optional field)
    (interactive)
    (when (eq last-command 'self-insert-command)
      (set-cursor-color (if (my/can-expand)
                            yasnippet-can-fire-cursor-color
                          default-cursor-color))))

  (defun my/can-expand ()
    "Return true if right after an expandable thing."
    (or (abbrev--before-point) (yasnippet-can-fire-p)))

                                          ; As pointed out by Dmitri, this will make sure it will update color when needed.
  (remove-hook 'post-command-hook 'my/change-cursor-color-when-can-expand)

  (defun my/insert-space-or-expand ()
    "For binding to the SPC SPC keychord."
    (interactive)
    (condition-case nil (or (my/hippie-expand-maybe nil) (insert "  "))))
#+end_src

* helm
#+BEGIN_SRC emacs-lisp :tangle yes
  (message "***** use-package helm *****")
  (use-package helm
    :ensure t
    :diminish helm-mode
    :init
    (progn
      (require 'helm-config)
      (setq helm-candidate-number-limit 100)
      ;; From https://gist.github.com/antifuchs/9238468
      (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
	    helm-input-idle-delay 0.01  ; this actually updates things
					  ; reeeelatively quickly.
	    helm-yas-display-key-on-candidate t
	    helm-quick-update t
	    helm-M-x-requires-pattern nil
	    helm-ff-skip-boring-files t)
      (helm-mode))
    :bind (("C-c h" . helm-mini)
	   ("C-h a" . helm-apropos)
	   ("C-x C-b" . helm-buffers-list)
	   ("C-x b" . helm-buffers-list)
	   ("M-y" . helm-show-kill-ring)
	   ("M-x" . helm-M-x)
	   ("C-x c o" . helm-occur)
	   ("C-x c s" . helm-swoop)
	   ("C-x c y" . helm-yas-complete)
	   ("C-x c Y" . helm-yas-create-snippet-on-region)
	   ("C-x c b" . my/helm-do-grep-book-notes)
	   ("C-x c SPC" . helm-all-mark-rings)))
  (ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
#+END_SRC

#+RESULTS:

* Python
