emacs.html
<div id="outline-container-orgfc996b4" class="outline-3">
<h3 id="orgfc996b4"><span class="section-number-3">6.6</span> yas snippets (from Sacha)</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">yasnippet</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:diminish</span> yas-minor-mode
  <span style="color: #ff8A65;">:init</span> (yas-global-mode)
  <span style="color: #ff8A65;">:config</span>
  (<span style="color: #fff59d;">progn</span>
    (yas-global-mode)
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)</span>
    (<span style="color: #fff59d;">setq</span> yas-key-syntaxes '(<span style="color: #9ccc65;">"w_"</span> <span style="color: #9ccc65;">"w_."</span> <span style="color: #9ccc65;">"^ "</span>))
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Will be problem with yas upgrade...</span>
    (<span style="color: #fff59d;">setq</span> yas-installed-snippets-dir <span style="color: #9ccc65;">"~/.emacs.d/elpa/yasnippet-20170418.351/snippets"</span>)
    (<span style="color: #fff59d;">setq</span> yas-expand-only-for-last-commands nil)
    (yas-global-mode 1)
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(bind-key "\t" 'hippie-expand yas-minor-mode-map)</span>
    (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)
<span style="color: #b0bec5;">;;        </span><span style="color: #b0bec5;">(global-set-key (kbd "C-c y") (lambda () (interactive)</span>
<span style="color: #b0bec5;">;;                                         </span><span style="color: #b0bec5;">(yas/load-directory "~/elisp/snippets")))</span>
))
</code></pre>
</div>

<p>
From <a href="http://emacswiki.org/emacs/Yasnippet">http://emacswiki.org/emacs/Yasnippet</a>
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">shk-yas/helm-prompt</span> (prompt choices <span style="color: #84ffff;">&amp;optional</span> display-fn)
  <span style="color: #ffe4b5;">"Use helm to select a snippet. Put this into `</span><span style="color: #ffe4b5;">yas/prompt-functions.</span><span style="color: #ffe4b5;">'"</span>
  (<span style="color: #fff59d;">interactive</span>)
  (<span style="color: #fff59d;">setq</span> display-fn (<span style="color: #fff59d;">or</span> display-fn 'identity))
  (<span style="color: #fff59d;">if</span> (<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">helm-config</span>)
      (<span style="color: #fff59d;">let</span> (tmpsource cands result rmap)
        (<span style="color: #fff59d;">setq</span> cands (mapcar (<span style="color: #fff59d;">lambda</span> (x) (funcall display-fn x)) choices))
        (<span style="color: #fff59d;">setq</span> rmap (mapcar (<span style="color: #fff59d;">lambda</span> (x) (cons (funcall display-fn x) x)) choices))
        (<span style="color: #fff59d;">setq</span> tmpsource
              (list
               (cons 'name prompt)
               (cons 'candidates cands)
               '(action . ((<span style="color: #9ccc65;">"Expand"</span> . (<span style="color: #fff59d;">lambda</span> (selection) selection))))
               ))
        (<span style="color: #fff59d;">setq</span> result (helm-other-buffer '(tmpsource) <span style="color: #9ccc65;">"*helm-select-yasnippet"</span>))
        (<span style="color: #fff59d;">if</span> (null result)
            (<span style="color: #f36c60; font-weight: bold;">signal</span> 'quit <span style="color: #9ccc65;">"user quit!"</span>)
          (cdr (assoc result rmap))))
    nil))
</code></pre>
</div>

<p>
From <a href="https://github.com/pcmantz/elisp/blob/master/my-bindings.el">https://github.com/pcmantz/elisp/blob/master/my-bindings.el</a>
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> default-cursor-color <span style="color: #9ccc65;">"gray"</span>)
(<span style="color: #fff59d;">setq</span> yasnippet-can-fire-cursor-color <span style="color: #9ccc65;">"purple"</span>)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">It will test whether it can expand, if yes, cursor color -&gt; green.</span>
(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">yasnippet-can-fire-p</span> (<span style="color: #84ffff;">&amp;optional</span> field)
  (<span style="color: #fff59d;">interactive</span>)
  (<span style="color: #fff59d;">setq</span> yas--condition-cache-timestamp (current-time))
  (<span style="color: #fff59d;">let</span> (templates-and-pos)
    (<span style="color: #fff59d;">unless</span> (<span style="color: #fff59d;">and</span> yas-expand-only-for-last-commands
                 (not (member last-command yas-expand-only-for-last-commands)))
      (<span style="color: #fff59d;">setq</span> templates-and-pos (<span style="color: #fff59d;">if</span> field
                                  (<span style="color: #fff59d;">save-restriction</span>
                                    (narrow-to-region (yas--field-start field)
                                                      (yas--field-end field))
                                    (yas--templates-for-key-at-point))
                                (yas--templates-for-key-at-point))))
    (<span style="color: #fff59d;">and</span> templates-and-pos (first templates-and-pos))))

(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/change-cursor-color-when-can-expand</span> (<span style="color: #84ffff;">&amp;optional</span> field)
  (<span style="color: #fff59d;">interactive</span>)
  (<span style="color: #fff59d;">when</span> (eq last-command 'self-insert-command)
    (set-cursor-color (<span style="color: #fff59d;">if</span> (my/can-expand)
                          yasnippet-can-fire-cursor-color
                        default-cursor-color))))

(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/can-expand</span> ()
  <span style="color: #ffe4b5;">"Return true if right after an expandable thing."</span>
  (<span style="color: #fff59d;">or</span> (abbrev--before-point) (yasnippet-can-fire-p)))

                                        <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">As pointed out by Dmitri, this will make sure it will update color when needed.</span>
(remove-hook 'post-command-hook 'my/change-cursor-color-when-can-expand)

(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/insert-space-or-expand</span> ()
  <span style="color: #ffe4b5;">"For binding to the SPC SPC keychord."</span>
  (<span style="color: #fff59d;">interactive</span>)
  (<span style="color: #fff59d;">condition-case</span> nil (<span style="color: #fff59d;">or</span> (my/hippie-expand-maybe nil) (insert <span style="color: #9ccc65;">"  "</span>))))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf581247" class="outline-2">
<h2 id="orgf581247"><span class="section-number-2">7</span> helm</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #9ccc65;">"***** use-package helm *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">helm</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:diminish</span> helm-mode
  <span style="color: #ff8A65;">:init</span>
  (<span style="color: #fff59d;">progn</span>
    (<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">helm-config</span>)
    (<span style="color: #fff59d;">setq</span> helm-candidate-number-limit 100)
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">From https://gist.github.com/antifuchs/9238468</span>
    (<span style="color: #fff59d;">setq</span> helm-idle-delay 0.0 <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">update fast sources immediately (doesn't).</span>
          helm-input-idle-delay 0.01  <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">this actually updates things</span>
                                        <span style="color: #b0bec5;">; </span><span style="color: #b0bec5;">reeeelatively quickly.</span>
          helm-yas-display-key-on-candidate t
          helm-quick-update t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t)
    (helm-mode))
  <span style="color: #ff8A65;">:bind</span> ((<span style="color: #9ccc65;">"C-c h"</span> . helm-mini)
         (<span style="color: #9ccc65;">"C-h a"</span> . helm-apropos)
         (<span style="color: #9ccc65;">"C-x C-b"</span> . helm-buffers-list)
         (<span style="color: #9ccc65;">"C-x b"</span> . helm-buffers-list)
         (<span style="color: #9ccc65;">"M-y"</span> . helm-show-kill-ring)
         (<span style="color: #9ccc65;">"M-x"</span> . helm-M-x)
         (<span style="color: #9ccc65;">"C-x c o"</span> . helm-occur)
         (<span style="color: #9ccc65;">"C-x c s"</span> . helm-swoop)
         (<span style="color: #9ccc65;">"C-x c y"</span> . helm-yas-complete)
         (<span style="color: #9ccc65;">"C-x c Y"</span> . helm-yas-create-snippet-on-region)
         (<span style="color: #9ccc65;">"C-x c b"</span> . my/helm-do-grep-book-notes)
         (<span style="color: #9ccc65;">"C-x c SPC"</span> . helm-all-mark-rings)))
(ido-mode -1) <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Turn off ido mode in case I enabled it accidentally</span>
</code></pre>
</div>
</div>
</div>
