emacs.org
** Make jupyter default shell
#+BEGIN_SRC emacs-lisp :tangle no

  (setq jupyter-console-exec (substitute-in-file-name
			      "$HOME/local/miniconda3/envs/py36/bin/jupyter"))

  ;; (setq python-shell-interpreter jupyter-console-exec
  ;;       python-shell-interpreter-args "console --existing --simple-prompt")

  ;; python-shell-interpreter-args "--simple-prompt")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(ob-ipython--launch-driver "ryan")
(org-babel-ipython-initiate-session "ryan")
#+END_SRC

#+BEGIN_SRC ipython :session :async t
  print('babba')
  a = 'flathh'
  import time
  time.sleep(5)
  print('hi there')
  #plt.plot([1, 2,3 ])
#+END_SRC

#+RESULTS:
:RESULTS:
babba
hi there
:END:


** scimax, its version of ob-ipython

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (setq my-jupyter-args " console --existing --simple-prompt")
    ;; (setq my-jupyter-args " console --simple-prompt")
    ;; (setq ob-ipython-command (concat jupyter-console-exec my-jupyter-args))
      ;;(setq ob-ipython-command jupyter-console-exec)

    ;; see org-babel stuff for ipython in Org section above
    ;; http://kitchingroup.cheme.cmu.edu/blog/2017/01/29/ob-ipython-and-inline-figures-in-org-mode/#disqus_thread
    ;; Intermittent silliness!
    ;;(require 'cl-lib)  ;; Might be needed with 'loop' error.

    ;; (add-to-list 'load-path "~/.emacs.d/elisp/scimax")
    ;; (require 'scimax-org-babel-ipython)

;; Provides functions for working with files
(use-package f)

;; Functions for working with strings
(use-package s)

(use-package cl)
(use-package cl-lib)


  (load-file "/Users/rwoodard/.emacs.d/elisp/scimax/scimax-org-babel-ipython.el")
  (require 'scimax-org-babel-ipython)

  ;; (message "***** use-package scimax-org-babel-ipython *****")
  ;; (use-package scimax-org-babel-ipython
  ;;   :load-path "~/.emacs.d/elisp/scimax"
  ;;   :ensure t
  ;;   :config
  ;;   (setq ob-ipython-kernel-extra-args '("--simple-prompt")))

#+END_SRC

#+BEGIN_SRC ipython :session :results output drawer
a = 79302
print(a)
#+END_SRC

#+RESULTS:
:RESULTS:
79302
:END:

#+BEGIN_SRC ipython :session
print('hi')
#+END_SRC

** elpy
#+BEGIN_SRC emacs-lisp :tangle no
  ;; (setq elpy-rpc-backend "jedi")
  ;; Use conda env in shell from which Emacs was started!
  (use-package elpy
    :ensure t
    :bind (:map elpy-mode-map
		([f12] . elpy-shell-send-region-or-buffer)))
  (elpy-enable)
#+END_SRC

#+RESULTS:
| elpy-rpc--disconnect |

* Colors
** material
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package material-theme
    :ensure ;TODO: 
    :config
    ;;(load-theme 'material-light t)
    (load-theme 'material t)
    )
#+END_SRC

#+RESULTS:
: t

