emacs.html

<div id="outline-container-orgc71d81b" class="outline-2">
<h2 id="orgc71d81b"><span class="section-number-2">8</span> Python</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org3feba14" class="outline-3">
<h3 id="org3feba14"><span class="section-number-3">8.1</span> Make jupyter default shell</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> jupyter-console-exec (substitute-in-file-name
                            <span style="color: #9ccc65;">"$HOME/local/miniconda3/envs/py36/bin/jupyter"</span>))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq python-shell-interpreter jupyter-console-exec</span>
<span style="color: #b0bec5;">;;       </span><span style="color: #b0bec5;">python-shell-interpreter-args "console --existing --simple-prompt")</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">python-shell-interpreter-args "--simple-prompt")</span>
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(ob-ipython--launch-driver <span style="color: #9ccc65;">"ryan"</span>)
(org-babel-ipython-initiate-session <span style="color: #9ccc65;">"ryan"</span>)
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-ipython"><span style="color: #fff59d;">print</span>(<span style="color: #9ccc65;">'babba'</span>)
<span style="color: #ffcc80;">a</span> = <span style="color: #9ccc65;">'flathh'</span>
<span style="color: #fff59d;">import</span> time
time.sleep(5)
<span style="color: #fff59d;">print</span>(<span style="color: #9ccc65;">'hi there'</span>)
<span style="color: #b0bec5;">#</span><span style="color: #b0bec5;">plt.plot([1, 2,3 ])</span>
</code></pre>
</div>

<p>
babba
hi there
</p>
</div>
</div>


<div id="outline-container-org8037d11" class="outline-3">
<h3 id="org8037d11"><span class="section-number-3">8.2</span> scimax, its version of ob-ipython</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq my-jupyter-args " console --existing --simple-prompt")</span>
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq my-jupyter-args " console --simple-prompt")</span>
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq ob-ipython-command (concat jupyter-console-exec my-jupyter-args))</span>
      <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">(setq ob-ipython-command jupyter-console-exec)</span>

    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">see org-babel stuff for ipython in Org section above</span>
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">http://kitchingroup.cheme.cmu.edu/blog/2017/01/29/ob-ipython-and-inline-figures-in-org-mode/#disqus_thread</span>
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Intermittent silliness!</span>
    <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">(require 'cl-lib)  ;; Might be needed with 'loop' error.</span>

    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(add-to-list 'load-path "~/.emacs.d/elisp/scimax")</span>
    <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(require 'scimax-org-babel-ipython)</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Provides functions for working with files</span>
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">f</span>)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Functions for working with strings</span>
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">s</span>)

(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">cl</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">cl-lib</span>)


  (load-file <span style="color: #9ccc65;">"/Users/rwoodard/.emacs.d/elisp/scimax/scimax-org-babel-ipython.el"</span>)
  (<span style="color: #fff59d;">require</span> '<span style="color: #8bc34a;">scimax-org-babel-ipython</span>)

  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(message "***** use-package scimax-org-babel-ipython *****")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(use-package scimax-org-babel-ipython</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">:load-path "~/.emacs.d/elisp/scimax"</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">:ensure t</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">:config</span>
  <span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(setq ob-ipython-kernel-extra-args '("--simple-prompt")))</span>

</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-ipython"><span style="color: #ffcc80;">a</span> = 79302
<span style="color: #fff59d;">print</span>(a)
</code></pre>
</div>

<p>
79302
</p>

<div class="org-src-container">
<pre><code class="src src-ipython"><span style="color: #fff59d;">print</span>(<span style="color: #9ccc65;">'hi'</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org38cc182" class="outline-3">
<h3 id="org38cc182"><span class="section-number-3">8.3</span> elpy</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(setq elpy-rpc-backend "jedi")</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Use conda env in shell from which Emacs was started!</span>
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">elpy</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:bind</span> (<span style="color: #ff8A65;">:map</span> elpy-mode-map
              ([f12] . elpy-shell-send-region-or-buffer)))
(elpy-enable)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb77d135" class="outline-2">
<h2 id="orgb77d135"><span class="section-number-2">9</span> Colors</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orga003863" class="outline-3">
<h3 id="orga003863"><span class="section-number-3">9.1</span> material</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">material-theme</span>
  <span style="color: #ff8A65;">:ensure</span> <span style="color: #b0bec5;">;</span><span style="color: #b0bec5;">TODO: </span>
  <span style="color: #ff8A65;">:config</span>
  <span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">(load-theme 'material-light t)</span>
  (load-theme 'material t)
  )
</code></pre>
</div>
</div>
</div>
