emacs.org
** Sacha solarized
Sacha says:

#+BEGIN_QUOTE :tangle yes
Set up a light-on-dark color scheme.  I like light on dark because I
find it to be more restful. The color-theme in ELPA was a little odd,
though, so we define some advice to make it work. Some things still
aren't quite right.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (defadvice color-theme-alist (around sacha activate)
  ;;   (if (ad-get-arg 0)
  ;;       ad-do-it
  ;;     nil))
  (message "***** use-package color-theme and solarized *****")
  (use-package color-theme
    :ensure t)
  (use-package color-theme-solarized
    :ensure t)
  (defun my/setup-color-theme ()
    (interactive)
    (color-theme-solarized-dark)
    ;; (set-face-foreground 'secondary-selection "darkblue")
    ;; (set-face-background 'secondary-selection "lightblue")
    ;; (set-face-background 'font-lock-doc-face "black")
    ;; (set-face-foreground 'font-lock-doc-face "wheat")
    ;; (set-face-background 'font-lock-string-face "")
    ;; (set-face-background 'font-lock-string-face "black")
    ;; (set-face-foreground 'org-todo "green")
    ;; (set-face-background 'org-todo "black")
    )
  (eval-after-load 'color-theme (my/setup-color-theme))
#+END_SRC

#+BEGIN_QUOTE :tangle no
I sometimes need to switch to a lighter background for screenshots.
For that, I use =color-theme-vim=.

Some more tweaks to solarized:
#+END_QUOTE

NOTE:  not tangled!

#+BEGIN_SRC emacs-lisp :tangle no
  (when window-system
    (custom-set-faces
     '(erc-input-face ((t (:foreground "antique white"))))
     '(helm-selection ((t (:background "ForestGreen" :foreground "black"))))
     '(org-agenda-clocking ((t (:inherit secondary-selection :foreground "black"))) t)
     '(org-agenda-done ((t (:foreground "dim gray" :strike-through nil))))
     '(org-done ((t (:foreground "PaleGreen" :weight normal :strike-through t))))
     '(org-clock-overlay ((t (:background "SkyBlue4" :foreground "black"))))
     '(org-headline-done ((((class color) (min-colors 16) (background dark)) (:foreground "LightSalmon" :strike-through t))))
     '(outline-1 ((t (:inherit font-lock-function-name-face :foreground "cornflower blue"))))))
#+END_SRC
** org block faces
Testing these with kaolin theme...need work.
#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-src-block-faces '(("emacs-lisp" (:background "#363636"))
			      ("ipython" (:background "#363636"))
			      ("python" (:background "#363636"))))
#+END_SRC
** kaolin
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package kaolin-theme 
    :ensure t)
  ;;(color-theme-kaolin)
#+END_SRC

* Utility functions
** unfill paragraph
#+BEGIN_SRC emacs-lisp :tangle yes
;;; Stefan Monnier <foo at acm.org>. It is the opposite of fill-paragraph
    (defun unfill-paragraph (&optional region)
      "Takes a multi-line paragraph and makes it into a single line of text."
      (interactive (progn (barf-if-buffer-read-only) '(t)))
      (let ((fill-column (point-max))
            ;; This would override `fill-column' if it's an integer.
            (emacs-lisp-docstring-fill-column t))
        (fill-paragraph nil region)))
#+END_SRC

* Dashboard at startup
https://github.com/rakanalh/emacs-dashboard
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))
#+END_SRC
* Initial files to load
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (mapcar (lambda (path) (find-file path))
  ;; 	(list 
  ;; 	 "~/.emacs.d/init.el"
  ;; 	 "~/.emacs.d/zunused/ryan.org"
  ;; 	 "~/.emacs.d/emacs.org"
  ;; 	 ))
#+END_SRC

* shell, term, etc.
#+BEGIN_SRC emacs-lisp :tangle yes
;; I like zsh from non-emacs, but keep things simple within emacs.
(setq explicit-shell-file-name "/bin/bash")
#+END_SRC
(add-to-list 'load-path "~/.emacs.d")
(load-library "terms_and_shells")
* My function key bindings
** Summary table
*** old

|     | f                | shift                               | meta            | ctrl             | super | hyper |
|-----+------------------+-------------------------------------+-----------------+------------------+-------+-------|
| f1  | only             | info                                | speedbar        | go to this table |       |       |
| f2  | split v          | split h                             | org ctl c ctl c |                  |       |       |
| f3  | bury             |                                     | prev src block  |                  |       |       |
| f4  | kill             |                                     | new block above |                  |       |       |
| f5  | other buffer     |                                     |                 |                  |       |       |
| f6  | other window     |                                     |                 |                  |       |       |
| f7  | eshell           |                                     |                 |                  |       |       |
| f8  | buffers menu     |                                     |                 |                  |       |       |
| f9  |                  | beg of buffer                       | new block below |                  |       |       |
| f10 | find file        | end of buffer                       | org next block  | tmm menu         |       |       |
| f11 | save-buffer      |                                     | org ctl c ctl c |                  |       |       |
| f12 | eval-last-sexp   |                                     | eval and step   | eval-last-sexp   |       |       |
|     | python send line | org-edit-special, org-edit-src-exit |                 |                  |       |       |
|     | sh send line     |                                     |                 |                  |       |       |
|-----+------------------+-------------------------------------+-----------------+------------------+-------+-------|

