emacs.html

<div id="outline-container-org38c3f09" class="outline-3">
<h3 id="org38c3f09"><span class="section-number-3">9.2</span> Sacha solarized</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Sacha says:
</p>

<blockquote>
<p>
Set up a light-on-dark color scheme.  I like light on dark because I
find it to be more restful. The color-theme in ELPA was a little odd,
though, so we define some advice to make it work. Some things still
aren't quite right.
</p>
</blockquote>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(defadvice color-theme-alist (around sacha activate)</span>
<span style="color: #b0bec5;">;;   </span><span style="color: #b0bec5;">(if (ad-get-arg 0)</span>
<span style="color: #b0bec5;">;;       </span><span style="color: #b0bec5;">ad-do-it</span>
<span style="color: #b0bec5;">;;     </span><span style="color: #b0bec5;">nil))</span>
(message <span style="color: #9ccc65;">"***** use-package color-theme and solarized *****"</span>)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">color-theme</span>
  <span style="color: #ff8A65;">:ensure</span> t)
(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">color-theme-solarized</span>
  <span style="color: #ff8A65;">:ensure</span> t)
(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/setup-color-theme</span> ()
  (<span style="color: #fff59d;">interactive</span>)
  (color-theme-solarized-dark)
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-foreground 'secondary-selection "darkblue")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-background 'secondary-selection "lightblue")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-background 'font-lock-doc-face "black")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-foreground 'font-lock-doc-face "wheat")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-background 'font-lock-string-face "")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-background 'font-lock-string-face "black")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-foreground 'org-todo "green")</span>
  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(set-face-background 'org-todo "black")</span>
  )
(eval-after-load 'color-theme (my/setup-color-theme))
</code></pre>
</div>

<blockquote>
<p>
I sometimes need to switch to a lighter background for screenshots.
For that, I use <code>color-theme-vim</code>.
</p>

<p>
Some more tweaks to solarized:
</p>
</blockquote>

<p>
NOTE:  not tangled!
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">when</span> window-system
  (custom-set-faces
   '(erc-input-face ((t (<span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"antique white"</span>))))
   '(helm-selection ((t (<span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"ForestGreen"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"black"</span>))))
   '(org-agenda-clocking ((t (<span style="color: #ff8A65;">:inherit</span> secondary-selection <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"black"</span>))) t)
   '(org-agenda-done ((t (<span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"dim gray"</span> <span style="color: #ff8A65;">:strike-through</span> nil))))
   '(org-done ((t (<span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"PaleGreen"</span> <span style="color: #ff8A65;">:weight</span> normal <span style="color: #ff8A65;">:strike-through</span> t))))
   '(org-clock-overlay ((t (<span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"SkyBlue4"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"black"</span>))))
   '(org-headline-done ((((class color) (min-colors 16) (background dark)) (<span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"LightSalmon"</span> <span style="color: #ff8A65;">:strike-through</span> t))))
   '(outline-1 ((t (<span style="color: #ff8A65;">:inherit</span> font-lock-function-name-face <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"cornflower blue"</span>))))))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org998d2df" class="outline-3">
<h3 id="org998d2df"><span class="section-number-3">9.3</span> org block faces</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Testing these with kaolin theme&#x2026;need work.
</p>
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">setq</span> org-src-block-faces '((<span style="color: #9ccc65;">"emacs-lisp"</span> (<span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"#363636"</span>))
                            (<span style="color: #9ccc65;">"ipython"</span> (<span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"#363636"</span>))
                            (<span style="color: #9ccc65;">"python"</span> (<span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"#363636"</span>))))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3faa183" class="outline-3">
<h3 id="org3faa183"><span class="section-number-3">9.4</span> kaolin</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">kaolin-theme</span> 
  <span style="color: #ff8A65;">:ensure</span> t)
<span style="color: #b0bec5;">;;</span><span style="color: #b0bec5;">(color-theme-kaolin)</span>
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c080f9" class="outline-2">
<h2 id="org4c080f9"><span class="section-number-2">10</span> Utility functions</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org44a6802" class="outline-3">
<h3 id="org44a6802"><span class="section-number-3">10.1</span> unfill paragraph</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;;; </span><span style="color: #b0bec5;">Stefan Monnier &lt;foo at acm.org&gt;. It is the opposite of fill-paragraph</span>
    (<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">unfill-paragraph</span> (<span style="color: #84ffff;">&amp;optional</span> region)
      <span style="color: #ffe4b5;">"Takes a multi-line paragraph and makes it into a single line of text."</span>
      (<span style="color: #fff59d;">interactive</span> (<span style="color: #fff59d;">progn</span> (barf-if-buffer-read-only) '(t)))
      (<span style="color: #fff59d;">let</span> ((fill-column (point-max))
            <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">This would override `</span><span style="color: #b0bec5;">fill-column</span><span style="color: #b0bec5;">' if it's an integer.</span>
            (emacs-lisp-docstring-fill-column t))
        (fill-paragraph nil region)))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org33f1ebe" class="outline-2">
<h2 id="org33f1ebe"><span class="section-number-2">11</span> Dashboard at startup</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="https://github.com/rakanalh/emacs-dashboard">https://github.com/rakanalh/emacs-dashboard</a>
</p>
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #fff59d;">use-package</span> <span style="color: #8bc34a;">dashboard</span>
  <span style="color: #ff8A65;">:ensure</span> t
  <span style="color: #ff8A65;">:config</span>
  (dashboard-setup-startup-hook))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgf3bbbde" class="outline-2">
<h2 id="orgf3bbbde"><span class="section-number-2">12</span> Initial files to load</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(mapcar (lambda (path) (find-file path))</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">     (list </span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">      "~/.emacs.d/init.el"</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">      "~/.emacs.d/zunused/ryan.org"</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">      "~/.emacs.d/emacs.org"</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">      ))</span>
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org970ff08" class="outline-2">
<h2 id="org970ff08"><span class="section-number-2">13</span> shell, term, etc.</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">I like zsh from non-emacs, but keep things simple within emacs.</span>
(<span style="color: #fff59d;">setq</span> explicit-shell-file-name <span style="color: #9ccc65;">"/bin/bash"</span>)
</code></pre>
</div>
<p>
(add-to-list 'load-path "~/.emacs.d")
(load-library "terms<sub>and</sub><sub>shells</sub>")
</p>
</div>
</div>
<div id="outline-container-org3ee203a" class="outline-2">
<h2 id="org3ee203a"><span class="section-number-2">14</span> My function key bindings</h2>
<div class="outline-text-2" id="text-14">
</div>
