emacs.org
*** current

Global

|     | f                           | shift                         | meta             | ctrl           |
|-----+-----------------------------+-------------------------------+------------------+----------------|
| f1  | only window                 | kill window                   | go to this table |                |
| f2  | split vertical (top/bottom) | split horizontal (left/right) |                  |                |
| f3  | bury buffer                 | kill buffer                   |                  |                |
| f4  |                             |                               |                  |                |
| f5  | other buffer                | browse url                    |                  |                |
| f6  | other window                | other window, reverse         |                  |                |
| f7  |                             | [python?  eshell?  shell?]    |                  |                |
| f8  | buffers menu                | speedbar toggle               | tmm menu         | info           |
| f9  |                             | beg of buffer                 |                  |                |
| f10 |                             | end of buffer                 |                  |                |
| f11 | save-buffer                 | find file                     |                  |                |
| f12 |                             |                               |                  | eval-last-sexp |
|-----+-----------------------------+-------------------------------+------------------+----------------|

org, org-src

|     | f                                         | shift               | meta                       | ctrl |
|-----+-------------------------------------------+---------------------+----------------------------+------|
| f1  |                                           |                     |                            |      |
| f2  |                                           |                     |                            |      |
| f3  |                                           |                     |                            |      |
| f4  | org C-c C-c                               | C-c C-c, next block | org C-c C-c c, new block   |      |
|     | org src Python C-c C-c buffer             |                     |                            |      |
| f5  |                                           |                     |                            |      |
| f6  |                                           |                     |                            |      |
| f7  |                                           |                     |                            |      |
| f8  |                                           |                     |                            |      |
| f9  | prev src block                            |                     | new block above            |      |
| f10 | next src block                            |                     | new block below            |      |
| f11 |                                           |                     |                            |      |
| f12 | (org, org src, el) eval line              | f12 then step       | org:     org-edit-special  |      |
|     | (org, org src, py) python send line       |                     | org src: org-edit-src-exit |      |
|     | (org, org src, sh) org src, sh: send line |                     |                            |      |
|-----+-------------------------------------------+---------------------+----------------------------+------|

