emacs.html
<div id="outline-container-org97eff84" class="outline-3">
<h3 id="org97eff84"><span class="section-number-3">14.1</span> Summary table</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org64ce37e" class="outline-4">
<h4 id="org64ce37e"><span class="section-number-4">14.1.1</span> old</h4>
<div class="outline-text-4" id="text-14-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">shift</th>
<th scope="col" class="org-left">meta</th>
<th scope="col" class="org-left">ctrl</th>
<th scope="col" class="org-left">super</th>
<th scope="col" class="org-left">hyper</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f1</td>
<td class="org-left">only</td>
<td class="org-left">info</td>
<td class="org-left">speedbar</td>
<td class="org-left">go to this table</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f2</td>
<td class="org-left">split v</td>
<td class="org-left">split h</td>
<td class="org-left">org ctl c ctl c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f3</td>
<td class="org-left">bury</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">prev src block</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f4</td>
<td class="org-left">kill</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">new block above</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f5</td>
<td class="org-left">other buffer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f6</td>
<td class="org-left">other window</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f7</td>
<td class="org-left">eshell</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f8</td>
<td class="org-left">buffers menu</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">beg of buffer</td>
<td class="org-left">new block below</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f10</td>
<td class="org-left">find file</td>
<td class="org-left">end of buffer</td>
<td class="org-left">org next block</td>
<td class="org-left">tmm menu</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f11</td>
<td class="org-left">save-buffer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">org ctl c ctl c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f12</td>
<td class="org-left">eval-last-sexp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">eval and step</td>
<td class="org-left">eval-last-sexp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">python send line</td>
<td class="org-left">org-edit-special, org-edit-src-exit</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sh send line</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga77d46b" class="outline-4">
<h4 id="orga77d46b"><span class="section-number-4">14.1.2</span> current</h4>
<div class="outline-text-4" id="text-14-1-2">
<p>
Global
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">shift</th>
<th scope="col" class="org-left">meta</th>
<th scope="col" class="org-left">ctrl</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f1</td>
<td class="org-left">only window</td>
<td class="org-left">kill window</td>
<td class="org-left">go to this table</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f2</td>
<td class="org-left">split vertical (top/bottom)</td>
<td class="org-left">split horizontal (left/right)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f3</td>
<td class="org-left">bury buffer</td>
<td class="org-left">kill buffer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f5</td>
<td class="org-left">other buffer</td>
<td class="org-left">browse url</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f6</td>
<td class="org-left">other window</td>
<td class="org-left">other window, reverse</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[python?  eshell?  shell?]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f8</td>
<td class="org-left">buffers menu</td>
<td class="org-left">speedbar toggle</td>
<td class="org-left">tmm menu</td>
<td class="org-left">info</td>
</tr>

<tr>
<td class="org-left">f9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">beg of buffer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">end of buffer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f11</td>
<td class="org-left">save-buffer</td>
<td class="org-left">find file</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f12</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">eval-last-sexp</td>
</tr>
</tbody>
</table>

<p>
org, org-src
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">shift</th>
<th scope="col" class="org-left">meta</th>
<th scope="col" class="org-left">ctrl</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f3</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f4</td>
<td class="org-left">org C-c C-c</td>
<td class="org-left">C-c C-c, next block</td>
<td class="org-left">org C-c C-c c, new block</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f9</td>
<td class="org-left">prev src block</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">new block above</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f10</td>
<td class="org-left">next src block</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">new block below</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f12</td>
<td class="org-left">(org, org src, el) eval line</td>
<td class="org-left">f12 then step</td>
<td class="org-left">org:     org-edit-special</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(org, org src, py) python send line</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">org src: org-edit-src-exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(org, org src, sh) org src, sh: send line</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
