emacs.html

<div id="outline-container-org1f8684c" class="outline-3">
<h3 id="org1f8684c"><span class="section-number-3">14.2</span> code</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">See examples at bottom of this file of ways to set keys.</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Global.</span>

(global-set-key [end]
                'move-end-of-line)
(global-set-key [home]
                'move-beginning-of-line)
(global-set-key (kbd <span style="color: #9ccc65;">"s-s"</span>)
                'isearch-forward)  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Mac command key</span>
(global-set-key (kbd <span style="color: #9ccc65;">"s-r"</span>)
                'isearch-backward)  <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Mac command key</span>

(add-hook 'isearch-mode-hook
          (<span style="color: #fff59d;">lambda</span> ()

            (define-key isearch-mode-map (kbd <span style="color: #9ccc65;">"s-s"</span>)
                'isearch-repeat-forward)
            (define-key isearch-mode-map (kbd <span style="color: #9ccc65;">"s-r"</span>)
                'isearch-repeat-backward)
                ))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Make only one window.</span>
(global-set-key [f1]
                'delete-other-windows)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Make this window go away.</span>
(global-set-key [S-f1]
                'delete-window)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Go to table of key bindings.</span>
(global-set-key [M-f1] 
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (bookmark-jump <span style="color: #9ccc65;">"keys"</span>)
                  (recenter-top-bottom 1)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Split window in half (top and bottom).</span>
(global-set-key [f2]
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (split-window-vertically)
                  (other-window 1)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Split window in half (left and right).</span>
(global-set-key [S-f2]
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (split-window-horizontally)
                  (other-window 1)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Bury buffer.</span>
(global-set-key [f3]
                'bury-buffer)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Kill buffer (require two key presses since it's a kill).</span>
(global-set-key [S-f3]
                'kill-buffer)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Switch to most recent buffer.</span>
(global-set-key [f5]
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (switch-to-buffer nil)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">JFGI</span>
(global-set-key [S-f5]
                'browse-url)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Go to next window.</span>
(global-set-key [f6] 
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (other-window 1)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Go to previous window.</span>
(global-set-key [S-f6] 
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (other-window -1)))

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">helm version of buffers.</span>
(global-set-key [f8]
                'helm-mini)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">speedbar</span>
(global-set-key [S-f8]
                'sr-speedbar-toggle)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">menu that a mouse would find.</span>
(global-set-key [M-f8]
                'tmm-menubar)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Info!</span>
(global-set-key [C-f8]
                'info)

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Top and bottom of buffer.</span>
(global-set-key [S-f9]
                'beginning-of-buffer)

(global-set-key [S-f10]
                'end-of-buffer)

(global-set-key [f10]
                'helm-find-files)

(global-set-key [f11]
                'save-buffer)

(global-set-key [C-f12]
                'eval-last-sexp)



(add-hook 'org-mode-hook
          (<span style="color: #fff59d;">lambda</span> ()

            (define-key org-mode-map [f4]
              'org-ctrl-c-ctrl-c)

            (define-key org-mode-map [f9]
              'org-previous-block)

            (define-key org-mode-map [f10]
              'org-next-block)

            (define-key org-mode-map [M-f9]
              'insert-new-block-same-as-current)

            (define-key org-mode-map [M-f10]
              'insert-new-block-same-as-current-below)

            (define-key org-mode-map [S-f4]
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (org-ctrl-c-ctrl-c)
                  (org-next-block)))

            (define-key org-mode-map [M-f4]
                (<span style="color: #fff59d;">lambda</span> ()
                  (<span style="color: #fff59d;">interactive</span>)
                  (org-ctrl-c-ctrl-c)
                  (insert-new-block-same-as-current-below)))

            (define-key org-mode-map [M-f12]
              'org-edit-special)

            ))


(add-hook 'org-src-mode-hook
          (<span style="color: #fff59d;">lambda</span> ()

            (define-key org-src-mode-map [M-f12]
              'org-edit-src-exit)

            ))


(<span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my/eval-line</span> (mode-specific-eval)
  <span style="color: #ffe4b5;">"Send entire current line to sh, elisp, python or whatever."</span>
  (<span style="color: #fff59d;">let</span> ((start (line-beginning-position))
        (end (line-end-position)))
    (funcall mode-specific-eval start end)))


(add-hook 'sh-mode-hook
          (<span style="color: #fff59d;">lambda</span>()

            (define-key sh-mode-map [f12]
              (<span style="color: #fff59d;">lambda</span> ()
                (<span style="color: #fff59d;">interactive</span>)
                (my/eval-line 'sh-execute-region)))

            (define-key sh-mode-map [S-f12]
              (<span style="color: #fff59d;">lambda</span> ()
                (<span style="color: #fff59d;">interactive</span>)
                (my/eval-line 'sh-execute-region)
                (end-of-line)
                (newline-and-indent)))

            ))


(add-hook 'python-mode-hook
          (<span style="color: #fff59d;">lambda</span>()

            (define-key python-mode-map [f12]
              (<span style="color: #fff59d;">lambda</span> ()
                (<span style="color: #fff59d;">interactive</span>)
                (my/eval-line 'python-shell-send-region)))

            (define-key python-mode-map [S-f12]
              (<span style="color: #fff59d;">lambda</span> ()
                (<span style="color: #fff59d;">interactive</span>)
                (my/eval-line 'python-shell-send-region)
                (end-of-line)
                (newline-and-indent)))

            ))


(add-hook 'emacs-lisp-mode-hook
          (<span style="color: #fff59d;">lambda</span>()

            (define-key emacs-lisp-mode-map [f12]
              (<span style="color: #fff59d;">lambda</span> ()
                (<span style="color: #fff59d;">interactive</span>)
                (my/eval-line 'eval-region)))

            ))



<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Cool things in term mode.</span>
<span style="color: #b0bec5;">;;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&#8216;C-c C-l&#8217;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&#8216;C-c C-o&#8217;</span>


<span style="color: #b0bec5;">;;;;</span>
<span style="color: #b0bec5;">;;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">Examples.</span>
<span style="color: #b0bec5;">;;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">From Info, examples of ways to set global keys:</span>
<span style="color: #b0bec5;">;;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "C-c y") 'clipboard-yank)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "C-M-q") 'query-replace)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "&lt;f5&gt;") 'flyspell-mode)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "C-&lt;f5&gt;") 'linum-mode)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "C-&lt;right&gt;") 'forward-sentence)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key (kbd "&lt;mouse-2&gt;") 'mouse-save-then-kill)</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key "\C-x\M-l" 'make-symbolic-link)</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">&lt;TAB&gt;</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key "\C-x\t" 'indent-rigidly)</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [?\C-=] 'make-symbolic-link)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [?\M-\C-=] 'make-symbolic-link)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [?\H-a] 'make-symbolic-link)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [f7] 'make-symbolic-link)</span>
<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [C-mouse-1] 'make-symbolic-link)</span>

<span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">(global-set-key [?\C-z ?\M-l] 'make-symbolic-link)</span>
</code></pre>
</div>
</div>
</div>
